In [1]:
import pandas as pd
idx = ['a','b','c','d','e']
data = [1,2,3,4,5]
series = pd.Series(data,index = idx)
print(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
series.shape

(5,)

In [4]:
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
fruits = {'orange':2,'banana':3}
print(pd.Series(fruits))

orange    2
banana    3
dtype: int64

In [14]:
s = pd.Series(fruits)
s[0:2]

orange    2
banana    3
dtype: int64

In [15]:
index = ["apple", "orange", "banana", "strawberry", "kiwifruit"]
data = [10, 5, 8, 12, 3]

series = pd.Series(data,index=index)
series

apple         10
orange         5
banana         8
strawberry    12
kiwifruit      3
dtype: int64

In [17]:
# 新增series 物件
grava = pd.Series([12],index=['grava'])

series = series.append(grava)
series

C:\Users\yifun\AppData\Local\Temp\ipykernel_8560\1060674361.py:4: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  series = series.append(grava)

apple         10
orange         5
banana         8
strawberry    12
kiwifruit      3
grava         12
dtype: int64

In [18]:
# 刪除series物件
series = series.drop("grava")
series

apple         10
orange         5
banana         8
strawberry    12
kiwifruit      3
dtype: int64

#### 用條件去選出

In [19]:
cond = [True,True,False,False,False]
print(series[cond])

apple     10
orange     5
dtype: int64

In [22]:
print(series[series > 5])

apple         10
banana         8
strawberry    12
dtype: int64

In [24]:
series[series >= 5][series < 10]

orange    5
banana    8
dtype: int64

In [25]:
i1 = series.sort_index()
i2 = series.sort_values()
print(i1)
print()
print(i2)

apple         10
banana         8
kiwifruit      3
orange         5
strawberry    12
dtype: int64

kiwifruit      3
orange         5
banana         8
apple         10
strawberry    12
dtype: int64

In [28]:
index = ["apple", "orange", "banana", "strawberry", "kiwifruit"]
data1 = [10, 5, 8, 12, 3]
data2 = [30, 25, 12, 10, 8]
series1 = pd.Series(data1,index=index)
series2 = pd.Series(data2,index=index)
df = pd.DataFrame([series1,series2])
df.index = [1,2]
df

   apple  orange  banana  strawberry  kiwifruit
1     10       5       8          12          3
2     30      25      12          10          8

In [44]:
# 插入新資料在dataframe中
index = ["apple", "orange", "banana", "strawberry", "kiwifruit"]
s = pd.Series([20,10,4,5,2],index = index)
df = df.append(s,ignore_index=True)

# 插入新column
index.append('pineapple')
df

C:\Users\yifun\AppData\Local\Temp\ipykernel_8560\3336014814.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(s,ignore_index=True)

   apple  orange  banana  strawberry  kiwifruit
0     10       5       8          12          3
1     30      25      12          10          8
2     20      10       4           5          2

In [46]:
data3 = [1,2,3,4,5,6]
s3 = pd.Series(data3, index = index)
df = df.append(s3,ignore_index=True)
df

C:\Users\yifun\AppData\Local\Temp\ipykernel_8560\1219368162.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(s3,ignore_index=True)

   apple  orange  banana  strawberry  kiwifruit  pineapple
0     10       5       8          12          3        NaN
1     30      25      12          10          8        NaN
2     20      10       4           5          2        NaN
3      1       2       3           4          5        6.0

In [47]:
data = {"fruits": ["apple", "orange", "banana", "strawberry",
  "kiwifruit"],
  "year": [2001, 2002, 2001, 2008, 2006],
  "time": [1, 4, 5, 6, 3]}

df = pd.DataFrame(data)
df['price'] = [150, 120, 100, 300, 150] # 直接在資料中新增一個欄位並賦值
df

       fruits  year  time  price
0       apple  2001     1    150
1      orange  2002     4    120
2      banana  2001     5    100
3  strawberry  2008     6    300
4   kiwifruit  2006     3    150

In [52]:
new_col = pd.Series([20,20,25,10,6],index = [0,1,2,3,4]) 

df['weight'] = new_col
df

       fruits  year  time  price  weight
0       apple  2001     1    150      20
1      orange  2002     4    120      20
2      banana  2001     5    100      25
3  strawberry  2008     6    300      10
4   kiwifruit  2006     3    150       6

#### 取出Dataframe 中的元素

In [55]:
# .loc : 利用索引位置、欄位名稱去取出資料
df.loc[[1,2,3],["price","weight"]]

   price  weight
1    120      20
2    100      25
3    300      10

In [91]:
import numpy as np

np.random.seed(0)

df = pd.DataFrame()

cols = ['Curry','KT','KD','Green','Looney']
for i in cols:
    df[i] = np.random.choice(range(1,11),10)

print(df)

   Curry  KT  KD  Green  Looney
0      6   8   6      3      10
1      1   7  10      4      10
2      4   9   9      9       1
3      4   9  10      2       5
4      8   2   5      4       8
5     10   7   4      4       4
6      4   8   1      4       3
7      6   8   4      8       8
8      3   9   6      1       3
9      5   2   1      2       1

In [87]:
df.loc[range(2,6),['Curry','KD']]

   Curry  KD
2      4   9
3      4  10
4      8   5
5     10   4

In [88]:
# iloc: 指定確切的索引值，去取出值
df.iloc[[1,3,5,7,9],[0,1,2]] # row index、column index

   Curry  KT  KD
1      1   7  10
3      4   9  10
5     10   7   4
7      6   8   4
9      5   2   1

In [92]:
# 刪列
df = df.drop([0,1,2]) # row index
df

   Curry  KT  KD  Green  Looney
3      4   9  10      2       5
4      8   2   5      4       8
5     10   7   4      4       4
6      4   8   1      4       3
7      6   8   4      8       8
8      3   9   6      1       3
9      5   2   1      2       1

In [93]:
# 刪欄
df = df.drop("KD",axis=1)
df

   Curry  KT  Green  Looney
3      4   9      2       5
4      8   2      4       8
5     10   7      4       4
6      4   8      4       3
7      6   8      8       8
8      3   9      1       3
9      5   2      2       1

In [94]:
df = df.drop(np.arange(3,9,2))
df

   Curry  KT  Green  Looney
4      8   2      4       8
6      4   8      4       3
8      3   9      1       3
9      5   2      2       1

In [95]:
df = df.sort_values(by = ["Curry"], ascending = True) # 根據欄位數值去排列
df

   Curry  KT  Green  Looney
8      3   9      1       3
6      4   8      4       3
9      5   2      2       1
4      8   2      4       8

In [72]:
print(df.index % 2 == 0) # 先抓出偶數index的boolean
print(df[df.index % 2 == 0])

[ True  True False  True]
   Curry  KT  Green  Looney
8      3   9      1       3
6      4   8      4       3
4      8   2      4       8

In [96]:
# 抓出Curry > 3 和KT > 5
df = df[df['Curry'] > 3]
df = df[df['KT'] > 5]
df

   Curry  KT  Green  Looney
6      4   8      4       3